Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K33.tmx
Source language: en_us
Languages: zh_cn

source: Visiting
zh_cn: 拜访

source: He had become used to the way Marc turned questions around.
zh_cn: 他已经习惯于马克绕开问题的方式了。

source: His son was like Superman in that way, catching bullets in his hand and redirecting them.
zh_cn: 他的儿子在这方面非常有天赋，就像超人能够抓住子弹并且改变它们的方向。

source: His own father had never answered his questions.
zh_cn: 他自己的父亲从没有回答过他的问题。

source: He was not sure which was worse, to be mocked or to be ignored.
zh_cn: 他不知道怎样才算是更糟糕的，被嘲弄，还是被忽视。

source: He brought in his shirt pocket the last photograph he'd taken of his son, an Instamatic snapshot: the carousel in the Park, wind in the boy's hair, chocolate ice cream staining his smile, a pair of impossibly tiny blue jeans, striped socks, and a Yale sweatshirt snug across his chest.
zh_cn: 他把他拍的儿子的最后一张照片放进衬衫口袋里，这是一张傻瓜相机拍的：公园里的旋转木马，吹过男孩发间的风，巧克力冰激凌弄脏了他的微笑，一条洗得发白的牛仔裤，条纹袜子，穿着一件舒适的耶鲁大学的运动毛衣。

source: Jonathan had stood waiting in the grass for Marc to come around.
zh_cn: 乔纳森在草地上等待着，马克在旋转木马上转圈。

source: The December day was warm, winter with a fever.
zh_cn: 12月的天气还是很温暖，对于冬天来说有点太热了。

source: Marc smiled, gripped tight the reins of his white plastic horse.
zh_cn: 马克微笑着，紧紧抓着白色塑料马的腰部。

source: This was years ago.
zh_cn: 这是两年前的照片。

source: Then, the visits were easy.
zh_cn: 那时，探视还很容易。

source: Jonathan took the picture with him in case Marc wanted to see proof, evidence of a time when they had been able to maintain peace.
zh_cn: 乔纳森带上照片以防马克想看证据，他们曾经和平共处的证据。

source: Jonathan was not above superstition.
zh_cn: 乔纳森还是相信迷信的。

source: His boy was a teenager now.
zh_cn: 他的男孩现在已经成长为一个青年了。

source: They were separated by three miles, one river, one bridge, and two train transfers. The distance, he thought often, was far too great.
zh_cn: 他们之间相隔了3英里，一条河，一座桥，两座火车站，这个距离，对于乔纳森来说，实在是太远了。

source: He stood on the street below the apartment, his head to the sky; he tried to find the 18th story, where Marc lived with his mother.
zh_cn: 他站在公寓下的街上，抬头看向天空；试着找到马克和他母亲居住的第18层。

source: Each window looked the same from the ground: the slotted vent of an air conditioner, ivy trained to the brick, small square glass panes in a grid.
zh_cn: 从地面上来看，每扇窗户都差不多：都有着空调的通气管道，常春藤爬满砖墙表面，排成网格状的小玻璃窗。

source: For nearly 15 years, Julia had lived on this block, with its old gingko trees, its gas lanterns, and its wide sidewalks.
zh_cn: 近15年来，茱莉亚都住在这个街区，和古老的银杏树，瓦斯灯，还有宽阔的人行道一起。

source: Steps away, in Central Park, children skated to Tchaikovsky on Wollman Rink, and through the trees he could hear the violins and the piano and the cymbals.
zh_cn: 几步之外，在中心公园里，孩子们在柴可夫斯基的曲子的伴奏下在沃尔曼夫溜冰场上溜冰，从树丛的对面还传来小提琴，钢琴，铜钹的声音。

source: This was, in every way, a better place than where he lived.
zh_cn: 在各方面来说，和他住的地方比起来，这里要好得多。

source: He'd rented a car for the afternoon. Parking had been difficult.
zh_cn: 下午他租了一辆车，但停车很困难。

source: He had lived too long in the city.
zh_cn: 他在城市里居住的时间太长了。

source: From the sidewalk, he saw in the passenger-side window the reflection of his face and neck, streaked with the harsh winter sun, unflattering and bright.
zh_cn: 走在人行道上，在冬日惨淡阳光的照耀下，车窗里映照出他的脸和脖子，清楚而又明亮。

source: He had turned, at some point, into every man in his family.
zh_cn: 在某些时刻，他已经拜访了家庭中的每个人。

source: His mother had hoped that such a thing would not happen.
zh_cn: 他母亲希望这种事不会发生。

source: She had said this, touching her hand to him, many years ago.
zh_cn: 很多年前，母亲握着他的手曾这样说过。

source: When he stepped into the lobby, he was met with a wall of warm air.
zh_cn: 走进大厅时，温暖的空气迎面而来。

source: He nodded at the doorman, and cleared his throat. "Could you let Marc know that I'm here for him?"
zh_cn: 他对看门人点头致意，清了清嗓子，说道：“可以麻烦你告诉马克我在这等他吗？”

source: Jonathan waited on a small white banquette, and rested his hands on the tops of his knees.
zh_cn: 乔纳萨坐在一张小的白色长凳上，等着他的儿子，手搁在膝盖上。

source: The doorman pushed two buttons. "Mister Morris," the man said. "Your father is here for you."
zh_cn: 看门人安了两下按钮，说道：“莫里斯先生，你的父亲在这等你。”

source: The name Morris still sounded inaccurate.
zh_cn: 莫里斯这个名字听起来仍旧刺耳。

source: He'd fought over nothing but the name, and just to hear it here, in an empty lobby, spoken by a stranger, the softness of those last two letters, like something easy off the tongue, caused him to grimace.
zh_cn: 他曾为了这个名字而努力过，现在在这听到，在一个空空的大厅里，从一个陌生人口中，那温和的最后两个音节，就像从舌头上脱落下来的什么东西，让他的表情变得痛苦。

source: He'd wanted to leave his boy with some unimpeachable part of him, something concrete.
zh_cn: 他离开了他的孩子，还认为这是不可指责的，理所应当的。

source: Julia worked so hard to mold their son in her image.
zh_cn: 茱莉亚努力的把他们的儿子培养成像她一样的人。

source: When they were married, she had done the same to him.
zh_cn: 当他们结婚时，她曾对乔纳森做过同样的事。

source: "Few parts of you are truly unimpeachable," she'd said.
zh_cn: “你的责任是不可推卸的。”她曾经这样说过。

source: He didn't know his son well.
zh_cn: 他对儿子的近况一无所知。

source: He blamed this on Marc, who had always been quiet and distant, and on Julia, who did her best to inject their son with a subtle hatred for him.
zh_cn: 还把这归咎于马克，认为他太沉默，太疏远了，归咎于茱莉亚，她向马克灌注了对他的一种微妙的敌意。

source: These were the clich¨¦d, well-documented symptoms of divorce, and he'd expected them.
zh_cn: 这些都是陈词滥调，很好的离婚理由，他已经期盼这些很久了。

source: What he hadn't expected, though, was how much they would bother him.
zh_cn: 但他没有料到的是这些事将会多么的困扰他。

source: Twenty-four times a year they ate pizza in silence and then sat in the back row of a Times Square movie theater.
zh_cn: 一年有24次，他孤零零的吃着披萨，然后坐在时代广场电影院的后排看电影。

source: The elevator doors opened, and his son walked out into the lobby.
zh_cn: 电梯门打开了，他儿子从里面走出来，进到大厅。

source: "Johnny Cohen," Marc called out.
zh_cn: “约翰尼·科恩,”马克喊道。

source: He never called him Dad.
zh_cn: 他从不叫他爸爸。

source: Marc made an overconfident swivel with his hips that to Jonathan looked vaguely sexual.
zh_cn: 马克用他的臀部做了一个过于自信的旋转，对于乔纳森来说这有些不男不女。

source: He spoke too loudly, and in short bursts, as if he were screaming across a football field.
zh_cn: 他大声而又急速的说话，就像正在足球场上尖叫。

source: He had headphones in his ears. "I'm. Like. Hungry. As. A. Horse."
zh_cn: 头上戴着耳机，说道，“我，饿了，像，一匹，马，一样饿。”

source: He wanted to give his son a hug.
zh_cn: 他想给他儿子一个拥抱。

source: They had done this when Marc was younger, but not for years.
zh_cn: 当马克还小时，他们经常这样做，但没有持续很多年。

source: He wondered whether his son could hear anything or whether his music disallowed, in its volume, any other noise.
zh_cn: 他不知道他儿子是否听得到，或许他的耳机音量太大了，使得他听不到其他的声音。

source: "You look good," he said.
zh_cn: “你看起来不错，”他说道。

source: Marc went out onto the street without stopping, pushing through the twin glass doors.
zh_cn: 马克推开两扇玻璃门，停都不停的走到街上。

source: When Jonathan followed him, he saw his boy's handprint as it remained on the glass.
zh_cn: 当乔纳森跟上去时，他看到了儿子留在玻璃门上的手印。

source: Marc had small hands with fat fingers, as if the rest of his body had grown out of infancy and his hands had been left behind.
zh_cn: 马克的手很小，手指很粗，就像他身体的其余部分已经脱离婴儿期了，但是手却没有。

source: Out on the street, Marc stood shaking his hips to the music in his ears.
zh_cn: 来到街上，马克还是随着耳机里的音乐晃动着他的臀部。

source: He wore tight black jeans that clung to the skin of his legs, white canvas sneakers, and a red hooded sweatshirt.
zh_cn: 他穿着紧贴着大腿皮肤的紧身黑色牛仔裤，白色帆布运动鞋，一件红色的帽兜运动衫。

source: Jonathan inspected his son for evidence of change.
zh_cn: 乔纳森观察着他儿子的改变。

source: He was pained by how much about Marc seemed different every time they were together.
zh_cn: 每次他们在一起时，乔纳森都发现马克改变了不少，这让他很痛苦。

source: "Are those new?" he asked, pointing to Marc's sneakers.
zh_cn: “这些是新的吗？”他指着马克的运动鞋问道。

source: "I used to have a pair of those."
zh_cn: “我以前也有一双。”

source: "Where are we going?"
zh_cn: “我们要去哪？”

source: Marc asked, yelling over the clamor of his headphones.
zh_cn: 戴着吵闹耳机的马克喊道。

source: "I'm hungry for pizza."
zh_cn: “我饿了，想吃披萨。”

source: "We're not getting pizza," Jonathan said, walking to his rented car. He put the key into the door.
zh_cn: “我们不是要去吃披萨，”乔纳森说着走向他租的车子，用钥匙打开了门。

source: "What's this?"
zh_cn: “这是什么？”

source: "It's a car, Marc."
zh_cn: “这是一辆车，马克。”

source: "I know it's a car."
zh_cn: “我知道这是一辆车。”

source: "Get in."
zh_cn: “进去吧。”

source: "Fuck that."
zh_cn: “我日。”

source: "I've told you not to talk to me like that."
zh_cn: “我告诉过你不要和我这样说话。”

source: "So," Marc said, tilting his head, putting a hand on the hood of the car. "Did you steal this?
zh_cn: “那么”，马克歪着头，把手放在引擎盖上，说道，“你偷得？

source: Because I thought you didn't have any money."
zh_cn: 我记得你根本没钱。”

source: "Who says I have no money?"
zh_cn: “谁说我没钱？”

source: "Mom says."
zh_cn: “妈妈说的。”

source: "Well, I might not have the sort of money your mother has," he said.
zh_cn: “好吧，我或许没有你妈妈那么多的钱，”他说道。

source: "But I have some money. Now get in the fucking car, Marc."
zh_cn: “但我还是有钱的，现在进那辆该死的车，马克。”

source: Jonathan drove north up the West Side Highway.
zh_cn: 乔纳森沿着西侧高速向北行驶。

source: The river glistened to his left.
zh_cn: 河流在他左边闪耀。

source: To his right, the city stretched out clean and blue.
zh_cn: 在右边，城市向着洁净湛蓝的远方延伸。

source: He had always loved Manhattan, its constant energies, the first day of spring in Union Square, nighttime below Canal Street; he only wished that he could afford to live there.
zh_cn: 他一直爱着曼哈顿，爱它持久的活力，爱联合广场春天的第一天，爱唐人街的夜晚；他只希望他有能力可以生活在这。

source: His apartment in Brooklyn sat across from a middle school, and twice a day, at seven-thirty in the morning and at three in the afternoon, a rush of noise surrounded his house.
zh_cn: 他在布鲁克林的公寓在一所中学的对面，每天两次，早上7点半和下午3点，总有一阵嘈杂的声音环绕在他房子周围。

source: He tried to listen to the high treble coming from his son's headphones.
zh_cn: 他试着听从他儿子耳机中传来的高音。

source: Marc shifted in the passenger seat, his weight on one side.
zh_cn: 马克在座椅中移动着，把体重压在了一边。

source: He could see only the back of his boy's head; he wondered what kind of music his son enjoyed.
zh_cn: 他只能看到儿子的后脑勺；他想知道是什么样的音乐使得他儿子如此入迷。

source: As they passed 125th Street, he saw, in the reflected glare of the window, that Marc was wearing black eyeliner.
zh_cn: 当他们 经过125号街时，他从反光镜里看到，马克正在画眼线。

source: "When I met your mother," he said, pointing at his son's eyes, "she used to do that."
zh_cn: “但我刚认识你母亲时,”他指着儿子的眼睛说，“她也这么干。”

source: "What was that?"
zh_cn: “你说什么？”

source: Marc said, touching a button, pausing the music.
zh_cn: 马克边说着，边按下了一个按钮停止了音乐。

source: "I said that your mother used to wear her makeup like that."
zh_cn: “我说你母亲以前也这么上妆。”

source: "Maybe Mom was a homo."
zh_cn: “或许妈妈以前是个同性恋。”

source: "Are you a homo?" he asked.
zh_cn: “你是同性恋吗？”他问道。

source: "You shouldn't use that kind of language, Cohen."
zh_cn: “你不能说这种话，科恩。”

source: His own father had never answered his questions, had let them dangle in the air and disappear.
zh_cn: 他自己的父亲从没有回答过他的问题，总是把问题就这么吊着，让它们自己消失。

source: The song in Marc's ears ended, and for a brief moment the headphones were silent.
zh_cn: 马克耳中的歌结束了，他的耳机安静了一小会。

source: When the music started again, another burst of noise, Jonathan reached out and grabbed the headphones from Marc's ears.
zh_cn: 当音乐再次响起时，又是一阵嘈杂声，乔纳森伸出手抓住了马克耳朵上的耳机。

source: "How about we give the music a rest?"
zh_cn: “让音乐停一会怎么样?”

source: "Fine," Marc said. He took a pack of cigarettes from the pocket of his sweatshirt. "Can I smoke at least?"
zh_cn: “好吧，”马克说着从衬衫口袋里拿出一包烟，“至少我可以抽烟吧？”

source: He saw that Marc smoked the same brand of cigarettes he had smoked when he was 15.
zh_cn: 他看着马克抽着他15岁时抽的相同牌子的香烟。

source: They were cheap, and terrible, and he wondered whether children could unconsciously sense these things about their parents, a taste for nicotine, a particular way of applying eyeliner.
zh_cn: 这种香烟很便宜，也很糟糕，乔纳森此时怀疑孩子是否会无意识中从父母那感受到这些事，像对尼古丁的口味，特定的画眼线的方式。

source: Marc had been an infant the last time Jonathan had owned a pack of cigarettes.
zh_cn: 乔纳森上次抽烟时马克还是一个婴儿。

source: "Of course you can't smoke."
zh_cn: “你当然不能抽烟。”

source: "You smoke."
zh_cn: “可是你抽烟。”

source: "I do not," he said. Years ago, he'd coughed strange black junk from his lungs for two weeks.
zh_cn: “我不抽，”他说道，数年前，他曾有两礼拜从肺里咳出奇怪的黑色东西。

source: Julia had come up behind him in the bathroom, looked into the sink, and whispered into his ear.
zh_cn: 茱莉亚跟在他后面进了浴室，看着水槽里的东西，在他耳边低语道。

source: "That's your lung, buddy."
zh_cn: “这是你的肺，伙计。”

source: They were living then in the Village, on East 13th Street, above a bakery.
zh_cn: 之后他们就住在13号街道的村子里，在一家面包店的对面。

source: They woke to the smell of confectioner's sugar.
zh_cn: 每天，他们闻着糖果店的甜味醒来。

source: Marc slept in a crib at the foot of the bed.
zh_cn: 马克睡在床边的一张婴儿床里。

source: "Mom says you smoke."
zh_cn: “妈妈说你抽烟。”

source: "I used to smoke," he said. "Just like her. But I quit. I'm glad I did."
zh_cn: “我过去抽。”他说，“就像她一样，但我戒掉了，我很庆幸我这么做了。”

source: "Whatever."
zh_cn: “随便啦。”

source: His son sank into his seat.
zh_cn: 他儿子重新坐好。

source: Before Marc was born, Jonathan was entirely confident that he possessed a paternal instinct, but after the birth he felt terribly unsure of how to hold his child, how to speak to him, how much food to give him.
zh_cn: 在马克出生前，乔纳森完全确信他有着强烈的父性本能，但当马克出生后，他感到很不确定如何抚养孩子，如何和他说话，该给他吃多少食物。

source: Child care had never become any easier.
zh_cn: 照顾孩子从来都不简单。

source: When Marc was a toddler, Jonathan had no idea how to quell the boy's tantrums.
zh_cn: 当马克是个小孩子时，乔纳森不知道怎么摆平他乱发的脾气。

source: Now that Marc was a teenager, Jonathan felt as if he were in the company of a ticking bomb.
zh_cn: 现在马克是个青年了，乔纳森感到他和一个定时炸弹在一起。

source: He was never sure how much time was left on the bomb, but he knew, sooner or later, that it would go off.
zh_cn: 他从不确定还有多久炸弹会爆炸，或迟或晚，它总会爆炸。

source: He turned off the Parkway and headed toward New England.
zh_cn: 他从公园路上下来，驶向新英格兰。

source: From here, he could see the entirety of Manhattan.
zh_cn: 从这，他能看到整个曼哈顿区。

source: The sight was gorgeous from this angle, the city from head to toe, water everywhere.
zh_cn: 从这个角度看到的景色十分华丽，城市从头到脚都被水包围。

source: While Jonathan took notice, Marc was staring at his sneakers.
zh_cn: 当乔纳森注意到时，马克正盯着他的运动鞋。

source: "We're going on a trip," Jonathan said.
zh_cn: “我们要去旅行。”乔纳森说。

source: "I see that we're going on a trip," Marc said.
zh_cn: “我知道我们要去旅行。”

source: "I'm not, like, blind, Cohen."
zh_cn: 马克说“我不像瞎子，科恩。”

source: "You having fun?"
zh_cn: “你开心吗?"

source: Marc shrugged his shoulders. "I don't like cars."
zh_cn: 马克耸耸肩，“我不喜欢汽车。”

source: "That's because you grew up here.
zh_cn: “这是因为你在这长大。

source: If you grew up anywhere else, you'd love them."
zh_cn: 如果你长在其他任何地方，你会爱上它们的。”

source: "Cars are for taxi drivers.
zh_cn: “车是给出租车司机用的。

source: Is that how you make your money these days?
zh_cn: 你这些天是不是就是这样赚钱的？

source: As a taxi driver?"
zh_cn: 做一个出租车司机？”

source: They drove the next five miles in silence.
zh_cn: 他们在沉默中又行驶了5英里。

source: Marc fiddled with the tiny black box that produced his music.
zh_cn: 马克摆弄着那个产生音乐的小黑盒子。

source: Jonathan glanced at the thing and remembered the enormous turntable he'd owned at 15.
zh_cn: 乔纳森扫了一眼那东西，想起了他15岁时拥有的大量电唱盘。

source: In his backyard, he'd built a solid oak cabinet to house the record player.
zh_cn: 在后院，他还做了一个坚固的橡木柜来安放唱片。

source: He'd needed help moving it to his bedroom.
zh_cn: 他需要帮助才能把它搬进卧室。

source: It was a piece of furniture.
zh_cn: 它就是一件家具。

source: Marc's music player was smaller than a baseball card.
zh_cn: 马克的音乐播放器比棒球卡还小。

source: When they left the city, driving through the wooded, green stretch between the Bronx and Connecticut, Marc began to chew his fingernails.
zh_cn: 当他们离开城市，穿越森林，绿色在布朗克斯和康奈迪克之间延伸开来，马克开始嚼他的手趾甲。

source: Jonathan turned the radio on.
zh_cn: 乔纳森打开收音机。

source: The Jets were playing the Patriots.
zh_cn: 喷气机队正在和爱国者队比赛（橄榄球队名）。

source: The game came across the air.
zh_cn: 比赛转播的电波从空中传来。

source: "Turn it off," Marc said.
zh_cn: “把它关掉 。”马克说。

source: "You don't like football?"
zh_cn: “你不喜欢橄榄球？”

source: "Where are we going, Jon?"
zh_cn: “我们要去哪，乔？”

source: "Rhode Island."
zh_cn: “罗德岛州。”

source: "What the fuck is in Rhode Island?"
zh_cn: “罗德岛州是他妈的怎么回事？”

source: "Why do you have to curse like that?"
zh_cn: “为什么你一直要这样诅咒一样的说话？”

source: "I'm cursing because you're driving me out of the state."
zh_cn: “我诅咒是因为你正要带着我出州。”

source: "We're going to Rhode Island so you can meet someone."
zh_cn: “我们去罗德岛州是为了 让你见些人。”

source: "Meet who?"
zh_cn: “见谁？”

source: Marc asked.
zh_cn: 马克问。

source: "Your grandfather."
zh_cn: “你祖父。”

source: "Grandpa's dead.
zh_cn: “祖父已经死了。

source: He died last year.
zh_cn: 他去年就死了。

source: You went to the funeral.
zh_cn: 你去葬礼。

source: Remember?
zh_cn: 记得吗？

source: Biggest heart attack in medical history?
zh_cn: 好像是医学史上最严重的心脏病？

source: Mom cried for, like, 10 weeks."
zh_cn: 妈妈为了这哭了10个礼拜。”

source: "Not Grandpa Joe," he said.
zh_cn: “不是祖父乔，”他说。

source: "We're going to see my father."
zh_cn: “我们要去见的是我父亲。”

source: "I thought he was dead too."
zh_cn: “我以为他也死了。”

source: "Well," he said, squeezing the steering wheel very tight.
zh_cn: “好吧，”他说，紧紧地抓住了方向盘。

source: "He's not."
zh_cn: “他还活着。”

source: Tucked into his jacket was a letter from his father's lawyer.
zh_cn: 塞在他夹克里的是一封来自他父亲律师的信。

source: The old man was dying.
zh_cn: 那老人马上就要死了。

source: After 18 years of silence, Jonathan had received a letter in the mail.
zh_cn: 沉默了18年后，乔纳森收到了一封信。

source: He'd always wondered how his father might die.
zh_cn: 他一直想知道他父亲怎么可能会死。
